from enum import Enum


class Messages(Enum):
    start_command = (
        'Привет, это команда Nissenger ✋',
        'Нашёл баг или есть чем поделиться с нами? Нажми на "Написать в Тех. Поддержку" и распиши тут, а мы обязательно прочтём и разберемся 🤖',
        'Хочешь связаться со школьной администрацией? Тогда нажимай на "Написать в Администрацию" и твое сообщение будет доставлено анонимно 🏫',
        'Если хочешь, чтобы мы связались с тобой — оставь номер телефона, ник телеграм аккаунта или почту 😎'
    )
